containers/fio/sample-output/sample-16k.out
randwritejob-16k: (g=0): rw=randwrite, bs=16K-16K/16K-16K/16K-16K, ioengine=libaio, iodepth=8
fio-2.2.8
Starting 1 process
randwritejob-16k: Laying out IO file(s) (1 file(s) / 100MB)
Jobs: 1 (f=1): [w(1)] [100.0% done] [0KB/128.8MB/0KB /s] [0/8196/0 iops] [eta 00m:00s]
randwritejob-16k: (groupid=0, jobs=1): err= 0: pid=126: Thu Oct 26 22:53:02 2017
  write: io=784064KB, bw=156781KB/s, iops=9798, runt=  5001msec
    slat (usec): min=7, max=959, avg=18.72, stdev=13.51
    clat (usec): min=75, max=205660, avg=794.74, stdev=2634.14
     lat (usec): min=96, max=205673, avg=813.78, stdev=2634.60
    clat percentiles (usec):
     |  1.00th=[  458],  5.00th=[  516], 10.00th=[  548], 20.00th=[  588],
     | 30.00th=[  628], 40.00th=[  668], 50.00th=[  716], 60.00th=[  764],
     | 70.00th=[  828], 80.00th=[  908], 90.00th=[ 1020], 95.00th=[ 1112],
     | 99.00th=[ 1384], 99.50th=[ 1736], 99.90th=[ 2832], 99.95th=[ 5088],
     | 99.99th=[205824]
    bw (KB  /s): min=101216, max=177056, per=100.00%, avg=157248.00, stdev=27232.45
    lat (usec) : 100=0.01%, 250=0.04%, 500=3.45%, 750=54.19%, 1000=30.89%
    lat (msec) : 2=11.11%, 4=0.24%, 10=0.05%, 20=0.02%, 250=0.02%
  cpu          : usr=7.20%, sys=25.60%, ctx=45208, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=49004/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: io=784064KB, aggrb=156781KB/s, minb=156781KB/s, maxb=156781KB/s, mint=5001msec, maxt=5001msec

Disk stats (read/write):
  vda: ios=0/47945, merge=0/22, ticks=0/37570, in_queue=37560, util=98.00%