containers/fio/sample-output/sample-4k.out
randwritejob-4k: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=8
fio-2.2.8
Starting 1 process
randwritejob-4k: Laying out IO file(s) (1 file(s) / 100MB)
Jobs: 1 (f=1): [w(1)] [100.0% done] [0KB/27596KB/0KB /s] [0/6899/0 iops] [eta 00m:00s]
randwritejob-4k: (groupid=0, jobs=1): err= 0: pid=121: Thu Oct 26 22:52:25 2017
  write: io=159748KB, bw=31690KB/s, iops=7922, runt=  5041msec
    slat (usec): min=6, max=2895, avg=36.83, stdev=44.81
    clat (usec): min=151, max=213545, avg=967.80, stdev=3146.24
     lat (usec): min=193, max=213566, avg=1005.37, stdev=3146.44
    clat percentiles (usec):
     |  1.00th=[  474],  5.00th=[  596], 10.00th=[  644], 20.00th=[  708],
     | 30.00th=[  764], 40.00th=[  812], 50.00th=[  868], 60.00th=[  924],
     | 70.00th=[  980], 80.00th=[ 1048], 90.00th=[ 1160], 95.00th=[ 1288],
     | 99.00th=[ 2064], 99.50th=[ 2608], 99.90th=[ 7776], 99.95th=[17024],
     | 99.99th=[214016]
    bw (KB  /s): min=14856, max=37280, per=100.00%, avg=31708.80, stdev=6635.32
    lat (usec) : 250=0.05%, 500=1.36%, 750=25.85%, 1000=46.05%
    lat (msec) : 2=25.58%, 4=0.87%, 10=0.17%, 20=0.04%, 100=0.02%
    lat (msec) : 250=0.02%
  cpu          : usr=6.75%, sys=32.94%, ctx=32627, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=39937/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: io=159748KB, aggrb=31689KB/s, minb=31689KB/s, maxb=31689KB/s, mint=5041msec, maxt=5041msec

Disk stats (read/write):
  vda: ios=0/39047, merge=0/70, ticks=0/35500, in_queue=35480, util=98.11%