containers/fio/sample-output/sample1.out
randwritejob: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=8
fio-2.2.8
Starting 1 process
randwritejob: Laying out IO file(s) (1 file(s) / 100MB)

randwritejob: (groupid=0, jobs=1): err= 0: pid=31: Wed Oct 25 21:57:03 2017
  write: io=163336KB, bw=32661KB/s, iops=8165, runt=  5001msec
    slat (usec): min=7, max=895, avg=28.64, stdev=18.60
    clat (usec): min=179, max=126503, avg=947.12, stdev=1778.23
     lat (usec): min=234, max=126515, avg=976.27, stdev=1778.21
    clat percentiles (usec):
     |  1.00th=[  540],  5.00th=[  652], 10.00th=[  716], 20.00th=[  780],
     | 30.00th=[  828], 40.00th=[  868], 50.00th=[  908], 60.00th=[  940],
     | 70.00th=[  988], 80.00th=[ 1048], 90.00th=[ 1128], 95.00th=[ 1208],
     | 99.00th=[ 1448], 99.50th=[ 1720], 99.90th=[ 2576], 99.95th=[ 6880],
     | 99.99th=[125440]
    bw (KB  /s): min=22304, max=36800, per=99.42%, avg=32469.33, stdev=4233.01
    lat (usec) : 250=0.01%, 500=0.46%, 750=14.63%, 1000=57.18%
    lat (msec) : 2=27.47%, 4=0.19%, 10=0.04%, 20=0.02%, 250=0.02%
  cpu          : usr=5.20%, sys=26.60%, ctx=38845, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=40834/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: io=163336KB, aggrb=32660KB/s, minb=32660KB/s, maxb=32660KB/s, mint=5001msec, maxt=5001msec

Disk stats (read/write):
  vda: ios=0/40011, merge=0/75, ticks=0/37340, in_queue=37310, util=97.98%